app/views/jobs/show.html.erb


<h5>Tags: <% @job.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."job_id" = $1  [["job_id", 66]]