app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Entertainment"], ["created_at", "2016-10-20 22:44:30.492908"], ["updated_at", "2016-10-20 22:44:30.492908"]]

  def update
    if @category.update(category_params)
---
UPDATE "categories" SET "title" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["title", "Drama"], ["updated_at", "2016-10-20 22:07:54.696298"], ["id", 41]]

  def destroy
    @category.delete
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 3]]