app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "test"], ["job_id", 37], ["created_at", "2016-10-23 18:27:58.840263"], ["updated_at", "2016-10-23 18:27:58.840263"]]
---
  def create
    job = Job.find(params[:job][:id])
    company = job.company
    @comment = @Comment.new(comment_params)
    @comment.job_id = job.id
    if @comment.save