app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."city" = $1  [["city", "Denver"]]
---
  def index
    @companies = Company.all.order(:city)

INSERT INTO "companies" ("name", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "whoa"], ["city", "whoa"], ["created_at", "2016-10-20 19:21:08.190909"], ["updated_at", "2016-10-20 19:21:08.190909"]]
---
  def create
    @company = Company.new(company_params)
    if @company.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    company = Company.find(params[:id])

UPDATE "companies" SET "name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["name", "EA Sports"], ["updated_at", "2016-10-20 19:20:15.252349"], ["id", 3]]
---
  def update
    @company.update(company_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 1]]
---
  def destroy
    company = Company.find(params[:id])
    company.delete