app/controllers/contacts_controller.rb

  def create
    company = Company.find(params[:company][:id])
    @contact = Contact.new(contact_params)
    @contact.company_id = company.id
    if @contact.save
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "contacts" ("name", "position", "email", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test"], ["position", "Test"], ["email", "Test"], ["company_id", 8], ["created_at", "2016-10-23 19:27:39.742685"], ["updated_at", "2016-10-23 19:27:39.742685"]]