app/controllers/dashboard_controller.rb

SELECT "companies".* FROM "companies"
---
  def index
    @jobs = Job.all
    @companies = Company.all