app/controllers/jobs_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "contacts".* FROM "contacts" WHERE "contacts"."company_id" = $1  ORDER BY created_at DESC  [["company_id", 8]]
---
  def index
    if params.include?("sort")
      @jobs = Job.all.order(:level_of_interest).reverse
      render :interest
    else
      @company = Company.find(params[:company_id])
      @jobs = @company.jobs
      @contact = Contact.new
      @contacts = @company.contacts.all.order('created_at DESC')

SELECT "categories".* FROM "categories"
---
  def new
    @job = Job.new()
    @category_options = Category.all.map{ |c| [c.title, c.id ]}

SELECT "categories".* FROM "categories"
---
  def create
    @job = @company.jobs.new(job_params)
    @category_options = Category.all.map{ |c| [c.title, c.id ]}

SELECT "comments".* FROM "comments" WHERE "comments"."job_id" = $1  ORDER BY created_at DESC  [["job_id", 37]]
---
  def show
    @comment = Comment.new
    @comments = @job.comments.all.order('created_at DESC')

SELECT "categories".* FROM "categories"
---
  def edit
    @category_options = Category.all.map{ |c| [c.title, c.id ]}

SELECT "categories".* FROM "categories"
---
  def update
    @category_options = Category.all.map{ |c| [c.title, c.id ]}

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", nil]]
---
  def set_company
    @company = Company.find(params[:company_id])