app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)
    if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "tag!"], ["created_at", "2016-10-24 01:13:00.319860"], ["updated_at", "2016-10-24 01:13:00.319860"]]

  def update
    @tag.update(tag_params)
---
UPDATE "tags" SET "name" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["name", "tag"], ["updated_at", "2016-10-24 01:13:32.594074"], ["id", 2]]

  def destroy
    tag = Tag.find(params[:id])
    tag.delete
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 1]]